---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCloudEngineRegistry.GetSupportedEngines
source: html/08b2cd40-97b9-bf3c-7890-ea622a5eaff0.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudEngineRegistry.GetSupportedEngines Method

Returns a list of the identifiers supported by point cloud engines registered to Revit.

## Syntax (C#)
```csharp
public static IList<string> GetSupportedEngines()
```

## Returns
The list of identifiers.